namespace BloodDanationSystem.Data.Seeding
{
    using System;
    using System.Collections.Generic;
    using System.Linq;
    using System.Threading.Tasks;

    using BloodDanationSystem.Data.Models;

    public class CitiesSeeder : ISeeder
    {
        public async Task SeedAsync(ApplicationDbContext dbContext, IServiceProvider serviceProvider)
        {
            if (dbContext.Cities.Any())
            {
                return;
            }

            var cities = new List<string>
            {
                "Благоевград",
                "Бургас",
                "Варна",
                "Велико Търново",
                "Видин",
                "Враца",
                "Габрово",
                "Добрич",
                "Кърджали",
                "Кюстендил",
                "Ловеч",
                "Монтана",
                "Пазарджик",
                "Перник",
                "Плевен",
                "Пловдив",
                "Разград",
                "Русе",
                "Силистра",
                "Сливен",
                "Смолян",
                "София",
                "Стара Загора",
                "Търговище",
                "Хасково",
                "Шумен",
                "Ямбол",
                "Лом",
                "Гоце Делчев",
                "Разлог",
                "Петрич",
                "Сандански",
                "Пещера",
                "Павликени",
                "Свищов",
                "Горна Оряховица",
                "Белоградчик",
                "Бяла Слатина",
                "Мездра",
                "Козлодуй",
                "Севлиево",
                "Трявна",
                "Балчик",
                "Каварна",
                "Албена",
                "Ардино",
                "Крумовград",
                "Момчилград",
                "Дупница",
                "Луковит",
                "Троян",
                "Тетевен",
                "Берковица",
                "Лом",
                "Велинград",
                "Панагюрище",
                "Асеновград",
                "Първомай",
                "Карлово",
                "Кубрат",
                "Бяла",
                "Дулово",
                "Тутракан",
                "Девин",
                "Мадан",
                "Златоград",
                "Ботевград",
                "Ихтиман",
                "Пирдоп",
                "Самоков",
                "Своге",
                "Етрополе",
                "Доганово",
                "Раднево",
                "Чирпан",
                "Гълъбово",
                "Омуртаг",
                "Търговище",
                "Свиленград",
                "Харманли",
                "Димитровград",
                "Нови Пазар",
            };

            for (int i = 0; i < cities.Count; i++)
            {
                await dbContext.Cities.AddAsync(new City
                {
                    Name = cities[i],
                });
            }
        }
    }
}
